In [2]:
#Import de fichier appelé exemple.xlsx
import pandas as pd
e=pd.read_excel("exemple.xlsx")

In [3]:
#Nous avons alors un data frame contenant nom, prénom,note1 et note2
e

        Nom   Prénom  Note 1  Note 2
0  Tremblay     Alex      16      12
1   Mestari  Ibrahim      13      16
2    Manjra     Sara      15      16

In [4]:
#Vérifions avec type
type(e)

pandas.core.frame.DataFrame

In [7]:
#Calculez la moyenne
e["Note finale"]=(e["Note 1"]+e["Note 2"])/2

In [8]:
e["Note finale"]

0    14.0
1    14.5
2    15.5
Name: Note finale, dtype: float64

In [9]:
"""Nous pouvons dès lors stocker ses résultats dans un fichier que nous allons créer avec la fct cette fois-ci to_Excel que 
nous allons appeler ici résultats avec l'extension xlsx"""
e.to_excel("résultat.xlsx")

In [11]:
e1=pd.read_csv("exemple.csv")

In [12]:
e1

  Nom;Prénom;Note 1;Note 2
0      Tremblay;Alex;16;12
1    Mestari;Ibrahim;13;16
2        Manjra;Sara;15;16

In [13]:
e1=pd.read_csv("exemple.csv",sep=";")

In [14]:
e1

        Nom   Prénom  Note 1  Note 2
0  Tremblay     Alex      16      12
1   Mestari  Ibrahim      13      16
2    Manjra     Sara      15      16